       >>SOURCE FORMAT IS FIXED
       IDENTIFICATION DIVISION.
       PROGRAM-ID. JSON-PARSE.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       I-O-CONTROL.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.
      *REPLACE ==:NEWLINE== BY ==& x"0a" &==

       01  WS-JSON-BLOB.
           05  WS-JSON-BLOB-DATA                PIC X(2048).
       01  WS-JSON-ROOT                         USAGE POINTER.
       01  WS-INPUT-LEN                         PIC 9(4).

       LOCAL-STORAGE SECTION.
       LINKAGE SECTION.
       01  LS-JSON-BLOB                         PIC X(2048).
       REPORT SECTION.
       SCREEN SECTION.

       PROCEDURE DIVISION CHAINING WS-JSON-BLOB.

       1000-MAIN.

       DISPLAY "LENGTH: " LENGTH OF WS-JSON-BLOB-DATA.
       INSPECT WS-JSON-BLOB-DATA TALLYING WS-INPUT-LEN FOR TRAILING
           SPACES.
       DISPLAY "TRAILING SPACES: " WS-INPUT-LEN.

       CALL STATIC "cJSON_Parse" USING WS-JSON-BLOB
           RETURNING WS-JSON-ROOT.

       SET ADDRESS OF LS-JSON-BLOB TO WS-JSON-ROOT.

       DISPLAY "ROOT: " WS-JSON-ROOT.
       DISPLAY "VALUE AT ROOT: " WS-JSON-BLOB.

       STOP RUN.
       1000-MAIN-END.
