      * Sample COBOL program
       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.
       OBJECT-COMPUTER.
       SPECIAL-NAMES.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       I-O-CONTROL.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  WS-VAL-1 PIC X(100).
       01  WS-VAL-1-LEN PIC S9(04) COMP-5.
       01  WS-CNT PIC S9(04) COMP-5.

       LOCAL-STORAGE SECTION.
       LINKAGE SECTION.
       REPORT SECTION.
       SCREEN SECTION.

       PROCEDURE DIVISION CHAINING WS-VAL-1.

       1000-MAIN.
       INSPECT FUNCTION REVERSE(WS-VAL-1) TALLYING WS-CNT FOR LEADING
       SPACES.

       COMPUTE WS-VAL-1-LEN = LENGTH OF WS-VAL-1 - WS-CNT.

       DISPLAY "LENGTH: " WS-VAL-1-LEN.
       DISPLAY "STRING: [" WS-VAl-1(1:WS-VAL-1-LEN) "]".

       STOP RUN.
       1000-MAIN-END.
       