      * Sample COBOL program
       IDENTIFICATION DIVISION.
       PROGRAM-ID. hello.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       DISPLAY "Hello World!".
       STOP RUN.
       